newwms_gift/src/Reports/ит_WMS_ПланированиеПроверок/ит_WMS_ПланированиеПроверок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ит_WMS_ПланированиеПроверок</name>
  <attributes>
    <name>АгрегацияПаллеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическаяПроверка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацияКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опалечивание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаНаценокПоКА</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЗадачу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

newwms_gift/src/Reports/ит_WMS_ПланированиеПроверок/Forms/ФормаОтчетаУпр/Module.bsl
&НаСервере
Процедура СохранитьНаСервере()
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("ДатаНачала",Отчет.ДатаНачала);
	СтруктураДанных.Вставить("ДатаОкончания",Отчет.ДатаОкончания);
	СтруктураДанных.Вставить("АгрегацияПаллеты",Отчет.АгрегацияПаллеты);
	СтруктураДанных.Вставить("ФизическаяПроверка",Отчет.ФизическаяПроверка);
	СтруктураДанных.Вставить("АгрегацияКоробов",Отчет.АгрегацияКоробов);
	СтруктураДанных.Вставить("Опалечивание",Отчет.Опалечивание);
	СтруктураДанных.Вставить("ТаблицаНаценокПоКАВыгрузка",Отчет.ТаблицаНаценокПоКА.Выгрузить());
  	итWMSПривилегированныйМодуль.СохрнаитьНастройкиВХранилищеОбщихНастроек("итWMSПланированиеПроверок","итWMSПланированиеПроверок",СтруктураДанных,ПараметрыСеанса.ТекущийПользователь);

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураХраненияДанных=итWMSПривилегированныйМодуль.ЗагрузитьНастройкиИзХранилищаОбщихНастроек("итWMSПланированиеПроверок","итWMSПланированиеПроверок",ПараметрыСеанса.ТекущийПользователь);
	Если ТипЗнч(СтруктураХраненияДанных)=Тип("Структура")  Тогда
		ЗаполнитьЗначенияСвойств(Отчет,СтруктураХраненияДанных);
		Если СтруктураХраненияДанных.Свойство("ТаблицаНаценокПоКАВыгрузка") Тогда 
			Отчет.ТаблицаНаценокПоКА.Загрузить(СтруктураХраненияДанных.ТаблицаНаценокПоКАВыгрузка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
